apple-open-source/macos/IOUSBFamily/AppleUSBOHCI/Classes/AppleUSBOHCI.cpp
    p->LogicalStart =  pLogicalAddress;
    p->PhysicalStart = kvtophys((vm_offset_t)pLogicalAddress);
    p->LogicalEnd = p->LogicalStart + count * _pageSize-1;
    p->PhysicalEnd = p->PhysicalStart + count * _pageSize-1;
    p->pNext = _pPhysicalLogical;

    _pPhysicalLogical = p;

    return (p->PhysicalStart);
}



//Allocate
IOReturn 
AppleUSBOHCI::AllocateMemory (int	num_of_TDs, int	num_of_EDs, int	num_of_ITDs)
{
    Ptr                                 p;
    UInt32                              physical;
    UInt32                              tdsPerPage, pagesTD,
        				edsPerPage, pagesED,
        				itdsPerPage, pagesITD;
    OHCIEndpointDescriptorPtr           FreeED, FreeEDCurrent;
    OHCIGeneralTransferDescriptorPtr    FreeTD, FreeTDCurrent;
    OHCIIsochTransferDescriptorPtr      FreeITD, FreeITDCurrent;
    UInt32                              i,j;
    
    tdsPerPage = _pageSize / sizeof (OHCIGeneralTransferDescriptor);
    pagesTD = (num_of_TDs + (tdsPerPage - 1)) / tdsPerPage;
    edsPerPage = _pageSize / sizeof (OHCIEndpointDescriptor);
    pagesED = (num_of_EDs + (edsPerPage - 1)) / edsPerPage;
    itdsPerPage = _pageSize / sizeof (OHCIIsochTransferDescriptor);
    pagesITD = (num_of_ITDs + (itdsPerPage - 1)) / itdsPerPage;

    _dataAllocationSize = ( (pagesED + pagesTD + pagesITD + 1) * _pageSize);
    p = (Ptr)IOMalloc(_dataAllocationSize);
    
    if (!p)
        return(kIOReturnNoMemory);

    for(i=0; i<(pagesED + pagesTD + pagesITD + 1) * _pageSize/4; i++)
	((UInt32 *)p)[i] = 0x12345678;
//    bzero(p, ((pagesED + pagesTD + pagesITD + 1) * pageSize));

    _pDataAllocation = p;
    // page align and 16 byte align (page align automagically
    // makes it 16 byte aligned)
    p = (Ptr) (((UInt32) p + (_pageSize - 1)) & ~(_pageSize - 1));
    //bzero(p, ((pagesED) * pageSize));

    
    // create a list of unused ED's, filling in Virtual address,
    // physicaladdress and virtual next physical next.
    FreeED = (OHCIEndpointDescriptorPtr) p;
    FreeEDCurrent = FreeED;
    _pFreeED = FreeED;

    for (i = 0 ; i < pagesED ; i++)
    {
        physical = kvtophys((UInt32)FreeEDCurrent);
        for (j = 0; j < edsPerPage; j++)
        {
            // create EDs
            FreeEDCurrent[j].pPhysical = physical + (j * sizeof (OHCIEndpointDescriptor));
            FreeEDCurrent[j].pLogicalNext = (&FreeEDCurrent[j+1]);
        }
        if (i != (pagesED - 1))
        {
            FreeEDCurrent[j-1].pLogicalNext = (OHCIEndpointDescriptorPtr)((UInt32) FreeEDCurrent + _pageSize);
        }
        else
        {
            FreeEDCurrent[j-1].pLogicalNext = NULL;
            _pLastFreeED = &FreeEDCurrent[j-1];
        }

        // goto next page
        FreeEDCurrent = (OHCIEndpointDescriptorPtr) ((UInt32) FreeEDCurrent + _pageSize);
        //physical += pageSize;
    }

    FreeTD = (OHCIGeneralTransferDescriptorPtr) FreeEDCurrent;
    FreeTDCurrent = FreeTD;
    _pFreeTD = FreeTD;
    for (i = 0; i < pagesTD; i++)
    {
        physical = GetPhysicalAddress((UInt32) FreeTDCurrent, 1);
        for (j = 0; j < tdsPerPage; j++)
        {
            //create TDs
            FreeTDCurrent[j].pPhysical = physical + (j * sizeof (OHCIGeneralTransferDescriptor));
            FreeTDCurrent[j].pLogicalNext = &(FreeTDCurrent[j+1]);
        }
        if (i != (pagesTD - 1))
        {
            FreeTDCurrent[j-1].pLogicalNext = (OHCIGeneralTransferDescriptorPtr)((UInt32) FreeTDCurrent + _pageSize);
        }
        else
        {
            FreeTDCurrent[j-1].pLogicalNext = NULL;
            _pLastFreeTD = &FreeTDCurrent[j-1];
        }

        // goto next page
        FreeTDCurrent = (OHCIGeneralTransferDescriptorPtr) ((UInt32) FreeTDCurrent + _pageSize);
        //physical += pageSize;
    }

   // set up freeitd queue
    FreeITD = (OHCIIsochTransferDescriptorPtr) FreeTDCurrent;
    FreeITDCurrent = FreeITD;
    _pFreeITD = FreeITD;
    for (i = 0; i < pagesITD; i++)
    {
        //physical = kvtophys(FreeITDCurrent);
        physical = GetPhysicalAddress((UInt32) FreeITDCurrent, 1);
        for (j = 0; j < itdsPerPage; j++)
        {
            // create TDs
            FreeITDCurrent[j].pPhysical = physical + (j * sizeof (OHCIIsochTransferDescriptor));
            FreeITDCurrent[j].pLogicalNext = (&FreeITDCurrent[j+1]);
        }
        if (i != (pagesITD - 1))
        {
            FreeITDCurrent[j-1].pLogicalNext = (OHCIIsochTransferDescriptorPtr)((UInt32) FreeITDCurrent + _pageSize);
        }
        else
        {
            FreeITDCurrent[j-1].pLogicalNext = NULL;
            _pLastFreeITD = &FreeITDCurrent[j-1];
        }

        // goto next page
        FreeITDCurrent = (OHCIIsochTransferDescriptorPtr) ((UInt32) FreeITDCurrent + _pageSize);
        //physical += pageSize;
    }
    
    // create a list of unused buffers?????

    return (kIOReturnSuccess);
}



OHCIIsochTransferDescriptorPtr 
AppleUSBOHCI::AllocateITD(void)
{
    OHCIIsochTransferDescriptorPtr freeITD;

    // pop a TD off of FreeITD list
    //
    freeITD = _pFreeITD;

    if (freeITD == NULL)
    {
        // If there are no TD's on the free list, then allocate another
        // page size worth of TD's and add themto the freeITD list
        
        OHCIIsochTransferDescriptorPtr freeITDCurrent;
        int 	j;
        int 	itdsPerPage;
        UInt32 	physical;
        
        USBLog(5,"%s[%p]: Out of Isoch TDs.  Allocating some more", getName(), this);
        
        // Note:  We should keep this pointer around so that we can release this
        // memory when the controller goes away (think PC Card)
        //
        UInt8 * p = (UInt8 *)IOMallocAligned(_pageSize, _pageSize);
        if(p == NULL) 
        {
            USBError(1, "%s[%p]: Could not create any more Isoch Transfer Descriptors!", getName(), this);
            return NULL;
        }

        itdsPerPage = _pageSize / sizeof (OHCIIsochTransferDescriptorPtr);
        _pFreeITD = freeITDCurrent = (OHCIIsochTransferDescriptorPtr)p;
        physical = GetPhysicalAddress((UInt32) freeITDCurrent, 1);
        
        for (j = 0; j < itdsPerPage-1; j++)
        {
            // Create TDs
            //
            freeITDCurrent[j].pPhysical = physical + (j * sizeof (OHCIIsochTransferDescriptorPtr));
            freeITDCurrent[j].pLogicalNext = &freeITDCurrent[j+1];
        }
        
        freeITDCurrent[j].pPhysical = physical + (j * sizeof (OHCIIsochTransferDescriptorPtr));
        freeITDCurrent[j].pLogicalNext = NULL;
        _pLastFreeITD = &freeITDCurrent[j];
        freeITD = _pFreeITD;
    }
    
    _pFreeITD = freeITD->pLogicalNext;
    freeITD->pLogicalNext = NULL;
    freeITD->uimFlags = 0;
    
    return freeITD;
}



OHCIGeneralTransferDescriptorPtr 
AppleUSBOHCI::AllocateTD(void)
{
    OHCIGeneralTransferDescriptorPtr freeTD;

    // pop a TD off of FreeTD list
    //if FreeTD == NULL return NULL
    // should we check if ED is full and if not access that????
    freeTD = _pFreeTD;

    if (freeTD == NULL)
    {
        // If there are no TD's on the free list, then allocate another
        // page size worth of TD's and add themto the freeTD list
        
        OHCIGeneralTransferDescriptorPtr freeTDCurrent;
        int 	j;
        int 	tdsPerPage;
        UInt32 	physical;
        
        USBLog(5,"%s[%p]: Out of General TDs.  Allocating some more", getName(), this);
        
        // Note:  We should keep this pointer around so that we can release this
        // memory when the controller goes away (think PC Card)
        //
        UInt8 * p = (UInt8 *)IOMallocAligned(_pageSize, _pageSize);
        if(p == NULL) 
        {
            USBError(1, "%s[%p]: Could not create any more Transfer Descriptors!", getName(), this);
            return NULL;
        }

        // Do we need to bzero the pointer?
        //
        tdsPerPage = _pageSize / sizeof (OHCIGeneralTransferDescriptor);
        _pFreeTD = freeTDCurrent = (OHCIGeneralTransferDescriptorPtr)p;
        physical = GetPhysicalAddress((UInt32) freeTDCurrent, 1);
        
        for (j = 0; j < tdsPerPage-1; j++)
        {
            // Create TDs
            //
            freeTDCurrent[j].pPhysical = physical + (j * sizeof (OHCIGeneralTransferDescriptor));
            freeTDCurrent[j].pLogicalNext = &freeTDCurrent[j+1];
        }
        
        freeTDCurrent[j].pPhysical = physical + (j * sizeof (OHCIGeneralTransferDescriptor));
        freeTDCurrent[j].pLogicalNext = NULL;
        _pLastFreeTD = &freeTDCurrent[j];
        freeTD = _pFreeTD;
    }
    
    _pFreeTD = freeTD->pLogicalNext;
    freeTD->pLogicalNext = NULL;
    freeTD->uimFlags = 0;
    freeTD->lastFrame = 0;		// used in timeout logic
    freeTD->lastRemaining = 0;		// used in timeout logic
    
    return freeTD;
}



